espressif/esp-claw/application/edge_agent/boards/QDTFT/QDTFT_2_8_ESP32_C5_Board/sdkconfig.defaults.board
# Board specific defaults for QDTFT 2.8-inch ESP32-C5 (16 MB flash, 8 MB PSRAM).
# Same configuration as the RockBase-iot NM-CYD-C5 board.

CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16 MB DIO 80 MHz
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16MB.csv"

# PSRAM: 8 MB quad 80 MHz. ESP32-C5 does not use ESP32-S3 OPI PSRAM options.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_AUTO=y

# USB: Serial JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
